pages/music-2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-25 Sun 14:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2026 in 52 albums</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../nmmull.css" />
</head>
<body>
<div id="org-div-home-and-up">[<a href="http://nmmull.github.io">back</a>]</div><div id="content" class="content">
<h1 class="title">2026 in 52 albums</h1>
<p>
The concept's pretty simple.  One album per week, not necessarily my
favorite album of the week, not necessarily a new album, just one that
I listened to and liked.
</p>
<ol class="org-ol">
<li><p>
<b>Snocaps</b> by Snocaps
</p>

<p>
Unapologetically catchy, produced enough to not feel like a demo
tape, but not so much that it has the sometimes-cloying polish of
recent Waxahatchee.  "Angel Wings" is the first ear-worm in a while
I've enjoyed having.
</p></li>

<li><p>
<b>With Greg from Deerhoof</b> by Serengeti
</p>

<p>
An unexpected but natural collaboration, the 17 minute ad-hoc live
session "I Got Your Password" is unreal.  This album has been on my
listening queue for years, but I think aptly captures 2026's
off-the-bat absurdities.
</p></li>

<li><p>
<b>Trio!</b> by Dabin Ryu
</p>

<p>
Dabin Ryu has classical-pianist-energy.  The opener "Vertigo" has
Ólafsson precision (sub Bach for post-bop) and the intro of "In the
Land of Oo-Bla-Dee" plays like a Prokofiev piano sonata.  Also goes
without saying, Joe Martin (bass) and Johnathan Blake (drums) hold
their own, and have plenty of their own shining moments.
</p></li>

<li><p>
<b>On A Friday Evening</b> by the Bill Evans Trio
</p>

<p>
Every so often, I need to listen to Evans.  And after week one of
the spring semester, I needed something with quiet strength.  Evans
for me straddles the Burkian beauty-sublime divide, the decisions
he makes with regard to phrasing seem written in the clouds.  I
also kinda love Eddie Gomez's buzzy bass in this recording, it
brings out the lightness and occasional humor of it all.
</p></li>
</ol>
</div>
</body>
</html>
